app/Services/DashboardService.php

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `user_type` = 'patient'
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `user_type` = 'dentist'
SELECT COUNT(*) AS `numrows` FROM `branches`
---
    public function getStatistics()
    {
        return [
            'totalUsers' => $this->userModel->countAll(),
            'totalPatients' => $this->userModel->where('user_type', 'patient')->countAllResults(),
            'totalDentists' => $this->userModel->where('user_type', 'dentist')->countAllResults(),
            'totalBranches' => $this->branchModel->countAll()

SELECT *
FROM `branches`
SELECT *
FROM `user`
WHERE `user_type` = 'dentist'
AND `status` = 'active'
---
    public function getFormData()
    {
        return [
            'patients' => $this->userModel->where('user_type', 'patient')->findAll(),
            'branches' => $this->branchModel->findAll(),
            'dentists' => $this->userModel->where('user_type', 'doctor')->where('status', 'active')->findAll(),