app/Services/UserService.php

    public function getUserStatistics()
    {
        return [
            'total_patients' => $this->userModel->where('user_type', 'patient')->countAllResults(),
            'active_patients' => $this->userModel->where('user_type', 'patient')->where('status', 'active')->countAllResults(),
            'total_dentists' => $this->userModel->where('user_type', 'dentist')->countAllResults(),
            'active_dentists' => $this->userModel->where('user_type', 'dentist')->where('status', 'active')->countAllResults(),
            'total_staff' => $this->userModel->where('user_type', 'staff')->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `user_type` = 'patient'
AND `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `user_type` = 'doctor'
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `user_type` = 'doctor'
AND `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `user_type` = 'staff'

    public function getRecentPatients($limit = 5)
    {
        return $this->userModel->where('user_type', 'patient')
                              ->orderBy('created_at', 'DESC')
                              ->limit($limit)
                              ->findAll();
---
SELECT *
FROM `user`
WHERE `user_type` = 'patient'
ORDER BY `created_at` DESC
 LIMIT 5