app/Services/UserService.php

SELECT *
FROM `user`
WHERE `user_type` = 'patient'
AND `status` = 'active'
ORDER BY `name` ASC
---
    public function getAllPatients($limit = null, $offset = 0)
    {
        $query = $this->userModel->where('user_type', 'patient')
                                ->where('status', 'active')  // Only get active patients
                                ->orderBy('name', 'ASC');

SELECT *
FROM `user`
WHERE `user_type` = 'patient'
ORDER BY `name` ASC
---
    public function getPatientsForActivation()
    {
        $query = $this->userModel->where('user_type', 'patient')
                                ->orderBy('name', 'ASC');