app/Views/admin/appointments/waitlist.php

function showDentistSelectionModal(appointmentId) {
    // Create modal for dentist selection
    const modal = document.createElement('div');
    modal.className = 'fixed inset-0 bg-gray-600 bg-opacity-50 z-50';
    modal.innerHTML = `
        <div class="flex items-center justify-center min-h-screen p-4">
            <div class="bg-white rounded-lg shadow-xl max-w-md w-full">
                <div class="p-6">
                    <h3 class="text-lg font-semibold text-gray-900 mb-4">Select Dentist</h3>
                    <div class="mb-4">
                        <label for="dentistSelect" class="block text-sm font-medium text-gray-700 mb-2">Choose a dentist:</label>
                        <select id="dentistSelect" class="w-full px-3 py-2 border border-gray-300 rounded-lg focus:outline-none focus:ring-2 focus:ring-blue-500">
                            <option value="">-- Select Dentist --</option>
                            <?php
                            $userModel = new \App\Models\UserModel();
                            $dentists = $userModel->where('user_type', 'doctor')->where('status', 'active')->findAll();
---
SELECT *
FROM `user`
WHERE `user_type` = 'dentist'
AND `status` = 'active'