app/Controllers/AdminController.php

    public function users()
    {
        $user = $this->getAuthenticatedUser();
        if ($user instanceof \CodeIgniter\HTTP\RedirectResponse) {
            return $user;
        }

        $userModel = new \App\Models\UserModel();
        $branchModel = new \App\Models\BranchModel();

        // Get all users except patients (they're managed separately)
        $users = $userModel->whereNotIn('user_type', ['patient'])->findAll();
        $branches = $branchModel->findAll();

        // Get branch assignments for each user with branch names
        $branchUserModel = new \App\Models\BranchUserModel();
        $branchAssignments = [];
        foreach ($users as $userData) {
            $assignments = $branchUserModel->select('branch_user.*, branches.name as branch_name')
                                          ->join('branches', 'branches.id = branch_user.branch_id')
                                          ->where('branch_user.user_id', $userData['id'])
                                          ->findAll();
---
SELECT *
FROM `user`
WHERE `user_type` NOT IN ('patient')
SELECT *
FROM `branches`
SELECT `branch_user`.*, `branches`.`name` as `branch_name`
FROM `branch_user`
JOIN `branches` ON `branches`.`id` = `branch_user`.`branch_id`
WHERE `branch_user`.`user_id` = '1'

    public function addUser()
    {
        $user = $this->getAuthenticatedUser();
        if ($user instanceof \CodeIgniter\HTTP\RedirectResponse) {
            return $user;
        }

        $branchModel = new \App\Models\BranchModel();
        $branches = $branchModel->findAll();
---
SELECT *
FROM `branches`

            'nationality' => $formData['nationality'] ?? null
        ];

        $userId = $userModel->insert($userData);
---
INSERT INTO `user` (`name`, `email`, `phone`, `user_type`, `password`, `gender`, `status`, `occupation`, `nationality`, `created_at`, `updated_at`) VALUES ('testing dentsit', 'testing@gmail.com', '2412124142124', 'dentist', '$2y$12$ZrHVx/5ks6YhgegybGahPuLgLKiZEbGCOwMGlV52DmO1gP.glVxcy', 'female', 'active', 'testing', 'testing', '2025-08-07 07:57:54', '2025-08-07 07:57:54')

            }

            foreach ($branches as $branchId) {
                $branchUserModel->insert([
                    'user_id' => $userId,
                    'branch_id' => $branchId,
                    'position' => $position
                ]);
---
INSERT INTO `branch_user` (`user_id`, `branch_id`, `position`) VALUES (11, '1', 'testing')

    public function editUser($id)
    {
        $user = $this->getAuthenticatedUser();
        if ($user instanceof \CodeIgniter\HTTP\RedirectResponse) {
            return $user;
        }

        $userModel = new \App\Models\UserModel();
        $branchModel = new \App\Models\BranchModel();
        $branchUserModel = new \App\Models\BranchUserModel();

        $userData = $userModel->find($id);
        if (!$userData) {
            return redirect()->to('/admin/users')->with('error', 'User not found.');
        }

        $branches = $branchModel->findAll();
        $assignedBranches = $branchUserModel->where('user_id', $id)->findAll();
---
SELECT *
FROM `user`
WHERE `user`.`id` = '10'
SELECT *
FROM `branches`
SELECT *
FROM `branch_user`
WHERE `user_id` = '10'

    public function updateUser($id)
    {
        $user = $this->getAuthenticatedUser();
        if ($user instanceof \CodeIgniter\HTTP\RedirectResponse) {
            return $user;
        }

        $formData = $this->request->getPost();

        $userModel = new \App\Models\UserModel();
        $branchUserModel = new \App\Models\BranchUserModel();

        $userData = $userModel->find($id);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '10'

    public function toggleUserStatus($id)
    {
        $user = $this->getAuthenticatedUser();
        if ($user instanceof \CodeIgniter\HTTP\RedirectResponse) {
            return $user;
        }

        $userModel = new \App\Models\UserModel();
        $userData = $userModel->find($id);

        if (!$userData) {
            return redirect()->to('/admin/users')->with('error', 'User not found.');
        }

        $newStatus = $userData['status'] === 'active' ? 'inactive' : 'active';
        $userModel->update($id, ['status' => $newStatus]);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '9'
UPDATE `user` SET `status` = 'inactive', `updated_at` = '2025-08-07 07:56:58'
WHERE `user`.`id` IN ('9')

    public function deleteUser($id)
    {
        $user = $this->getAuthenticatedUser();
        if ($user instanceof \CodeIgniter\HTTP\RedirectResponse) {
            return $user;
        }

        $userModel = new \App\Models\UserModel();
        $branchUserModel = new \App\Models\BranchUserModel();

        // Delete branch assignments first
        $branchUserModel->where('user_id', $id)->delete();

        // Delete user
        if ($userModel->delete($id)) {
---
DELETE FROM `branch_user`
WHERE `user_id` = '11'
DELETE FROM `user`
WHERE `id` IN ('11')