app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `user`.`id` = '4'
---
    public static function getCurrentUser()
    {
        if (self::isAuthenticated()) {
            $userModel = new UserModel();
            return $userModel->find(session()->get('user_id'));