app/Controllers/BaseAdminController.php

SELECT *
FROM `user`
WHERE `user_type` = 'patient'
SELECT *
FROM `branches`
SELECT *
FROM `user`
WHERE `user_type` = 'dentist'
AND `status` = 'active'
---
    protected function getAppointmentsView($viewPath, $additionalData = [])
    {
        $user = $this->getAuthenticatedUser();
        if ($user instanceof \CodeIgniter\HTTP\RedirectResponse) {
            return $user;
        }

        // Get form data for dropdowns
        $userModel = new \App\Models\UserModel();
        $branchModel = new \App\Models\BranchModel();

        $patients = $userModel->where('user_type', 'patient')->findAll();
        $branches = $branchModel->findAll();
        $dentists = $userModel->where('user_type', 'dentist')->where('status', 'active')->findAll();