app/Controllers/Dentist.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `appointments`.`user_id`
FROM `appointments`
WHERE `appointments`.`dentist_id` = '2'
GROUP BY `appointments`.`user_id`
) CI_count_all_results
---

        // Get total patients count for this dentist
        $userModel = new \App\Models\UserModel();
        $totalPatients = $appointmentModel->select('appointments.user_id')
                                         ->where('appointments.dentist_id', $user['id'])
                                         ->groupBy('appointments.user_id')
                                         ->countAllResults();