app/Models/BranchModel.php

SELECT *
FROM `branches`
---
    public function getActiveBranches()
    {
        return $this->findAll();